app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      #first we find the artist with the cooresponding id
      @artist = Artist.find_by(id: params[:artist_id])
      #then we implement a condition
      #if artist is empty, redirect to index and display error message
      #if artist is found, display songs for that specific artist
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found"
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]